Revit 2027 API
FabricationNetworkChangeServiceResult Enumeration
 Possible results from invoking the FabricationNetworkChangeService.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricationNetworkChangeServiceResult
Public Enumeration FabricationNetworkChangeServiceResult
public enum class FabricationNetworkChangeServiceResult
type FabricationNetworkChangeServiceResult
Members
Member name | Value | Description
InvalidSelection | 3 |  The selection of elements was invalid.
PartialFailure | 1 |  The change contained partial failures and will need to be fixed manually.
Success | 0 |  The change was successful.
UserAborted | 2 |  The change was aborted by the user.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace